driver-tests/jmsbc/JMSBCTests/JMSBCJbi/test/JMSPartAsComplexTypeTest_Invoke/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jms="http://j2ee.netbeans.org/wsdl/JMSBCComplexTypeTest">
  <soapenv:Body>
    <jms:MsgRequestPart>
      <StringElem>Hello World!</StringElem>
      <IntElem>88</IntElem>
    </jms:MsgRequestPart>
  </soapenv:Body>
</soapenv:Envelope>